//=============================================================================
// 当たり判定処理 [collision.cpp]
//=============================================================================
#include "main.h"
#include "collision.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// 構造体定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// BBによる当たり判定処理
// 回転は考慮しない
// 戻り値：当たってたらtrue
//=============================================================================
BOOL CollisionBB(XMFLOAT3 mpos, float mw, float mh,
    XMFLOAT3 ypos, float yw, float yh)
{
    BOOL ans = false;  // 外れをセットしておく

    // 座標が中心点なので計算しやすく半分にしている
    mw /= 2.0f;
    mh /= 2.0f;
    yw /= 2.0f;
    yh /= 2.0f;

    // バウンディングボックス(BB)の処理
    if ((mpos.x + mw > ypos.x - yw) &&
        (mpos.x - mw < ypos.x + yw) &&
        (mpos.y + mh > ypos.y - yh) &&
        (mpos.y - mh < ypos.y + yh))
    {
        // 当たった時の処理
        ans = true;
    }

    return ans;
}

//=============================================================================
// BCによる当たり判定処理
// サイズは半径
// 戻り値：当たってたらTRUE
//=============================================================================
BOOL CollisionBC(XMFLOAT3 pos1, XMFLOAT3 pos2, float r1, float r2)
{
	BOOL ans = FALSE;						// 外れをセットしておく

	float len = (r1 + r2) * (r1 + r2);		// 半径を2乗した物
	XMVECTOR temp = XMLoadFloat3(&pos1) - XMLoadFloat3(&pos2);
	temp = XMVector3LengthSq(temp);			// 2点間の距離（2乗した物）
	float lenSq = 0.0f;
	XMStoreFloat(&lenSq, temp);

	// 半径を2乗した物より距離が短い？
	if (len > lenSq)
	{
		ans = TRUE;	// 当たっている
	}

	return ans;
}



