//=============================================================================
//
// Countdown（）倒计时处理·
//
//=============================================================================
#pragma once



#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"




struct COUNTDOWN 
{
    int total_time_s;     // 总倒计时时间（秒）

    int extra_time_s;   // 当前剩余时间（秒）

    BOOL itOver;     // 倒计时是否结束
};


//*****************************************************************************
// マクロ定義
//*****************************************************************************



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


HRESULT InitCountdown(void);
void UninitCountdown(void);
void UpdateCountdown(void);
void DrawCountdown(void);

COUNTDOWN* GetCountdown(void);